Jris-373/GD32F470VET6/Driver/bsp/sdcard.c
    /* check whether the card is locked */
    if(sdio_response_get(SDIO_RESPONSE0) & SD_CARDSTATE_LOCKED) {
        status = SD_LOCK_UNLOCK_FAILED;
        return status;
    }

    /* blocksize is fixed in 512B for SDHC card */
    if(SDIO_HIGH_CAPACITY_SD_CARD != cardtype) {
        readaddr *= 512U;
    } else {
        blocksize = 512U;
    }
    
    align = blocksize & (blocksize - 1);
    if((blocksize > 0) && (blocksize <= 2048) && (0 == align)) {
        datablksize = sd_datablocksize_get(blocksize);
        /* send CMD16(SET_BLOCKLEN) to set the block length */
        bsp_tf_emit_progress(BSP_TF_PROGRESS_SD_READ_CMD16, readaddr);
        sdio_command_response_config(SD_CMD_SET_BLOCKLEN, (uint32_t)blocksize, SDIO_RESPONSETYPE_SHORT);
        sdio_wait_type_set(SDIO_WAITTYPE_NO);
        sdio_csm_enable();

        /* check if some error occurs */
        status = r1_error_check(SD_CMD_SET_BLOCKLEN);
        if(SD_OK != status) {
            return status;
        }
    } else {
        status = SD_PARAMETER_INVALID;
        return status;
    }

    stopcondition = 0;
    totalnumber_bytes = blocksize;
    expected_words = (blocksize + 3U) / 4U;

    /* send CMD17(READ_SINGLE_BLOCK) to read a block */
    bsp_tf_emit_progress(BSP_TF_PROGRESS_SD_READ_CMD17, readaddr);
    /* configure SDIO data transmission */
    sdio_flag_clear(SDIO_MASK_INTC_FLAGS);
    sdio_data_config(SD_DATATIMEOUT, totalnumber_bytes, datablksize);
    sdio_data_transfer_config(SDIO_TRANSMODE_BLOCK, SDIO_TRANSDIRECTION_TOSDIO);
    if(SD_DMA_MODE == transmode) {
        dma_receive_config(preadbuffer, blocksize);
        sdio_dma_enable();
    }
    sdio_dsm_enable();

    sdio_command_response_config(SD_CMD_READ_SINGLE_BLOCK, (uint32_t)readaddr, SDIO_RESPONSETYPE_SHORT);
    sdio_wait_type_set(SDIO_WAITTYPE_NO);
    sdio_csm_enable();
    /* check if some error occurs */
    status = r1_error_check(SD_CMD_READ_SINGLE_BLOCK);
    if(SD_OK != status) {
        if(SD_DMA_MODE == transmode) {
            sdio_dma_disable();
            dma_channel_disable(DMA1, DMA_CH3);
        }
        return status;
    }

    if(SD_POLLING_MODE == transmode) {
        /* polling mode */
        bsp_tf_record_progress(BSP_TF_PROGRESS_SD_READ_DATA);
        timeout = SD_DATA_POLL_TIMEOUT;
        while((!sdio_flag_get(SDIO_FLAG_DTCRCERR | SDIO_FLAG_DTTMOUT | SDIO_FLAG_RXORE | SDIO_FLAG_DTBLKEND | SDIO_FLAG_STBITE)) && (timeout > 0U)) {
            if((RESET != sdio_flag_get(SDIO_FLAG_RFH)) && ((words_read + SD_FIFOHALF_WORDS) <= expected_words)) {
                /* at least 8 words can be read in the FIFO */
                for(count = 0; count < SD_FIFOHALF_WORDS; count++) {
                    *(ptempbuff + count) = sdio_data_read();
                }
                ptempbuff += SD_FIFOHALF_WORDS;
                words_read += SD_FIFOHALF_WORDS;
            } else if((RESET != sdio_flag_get(SDIO_FLAG_RXDTVAL)) && (words_read < expected_words)) {
                *ptempbuff = sdio_data_read();
                ++ptempbuff;
                ++words_read;
            }
            --timeout;
        }
        if(!sdio_flag_get(SDIO_FLAG_DTCRCERR | SDIO_FLAG_DTTMOUT | SDIO_FLAG_RXORE | SDIO_FLAG_DTBLKEND | SDIO_FLAG_STBITE)) {
            sdio_flag_clear(SDIO_MASK_INTC_FLAGS);
            return SD_DATA_TIMEOUT;
        }

        /* whether some error occurs and return it */
        if(RESET != sdio_flag_get(SDIO_FLAG_DTCRCERR)) {
            status = SD_DATA_CRC_ERROR;
            sdio_flag_clear(SDIO_FLAG_DTCRCERR);
            return status;
        } else if(RESET != sdio_flag_get(SDIO_FLAG_DTTMOUT)) {
            status = SD_DATA_TIMEOUT;
            sdio_flag_clear(SDIO_FLAG_DTTMOUT);
            return status;
        } else if(RESET != sdio_flag_get(SDIO_FLAG_RXORE)) {
            status = SD_RX_OVERRUN_ERROR;
            sdio_flag_clear(SDIO_FLAG_RXORE);
            return status;
        } else if((RESET != sdio_flag_get(SDIO_FLAG_STBITE)) && (RESET == sdio_flag_get(SDIO_FLAG_DTEND))){
            status = SD_START_BIT_ERROR;
            sdio_flag_clear(SDIO_FLAG_STBITE);
            return status;
        }
        timeout = SD_DATA_POLL_TIMEOUT;
        while((RESET != sdio_flag_get(SDIO_FLAG_RXDTVAL)) && (words_read < expected_words) && (timeout > 0U)) {
            *ptempbuff = sdio_data_read();
            ++ptempbuff;
            ++words_read;
            --timeout;
        }
        if(0U == timeout) {
            sdio_flag_clear(SDIO_MASK_INTC_FLAGS);
            return SD_DATA_TIMEOUT;
        }
        /* clear the SDIO_INTC flags */
        sdio_flag_clear(SDIO_MASK_INTC_FLAGS);
    } else if(SD_DMA_MODE == transmode) {
        /* DMA mode */
        bsp_tf_record_progress(BSP_TF_PROGRESS_SD_READ_DATA);
        timeout = SD_DATA_POLL_TIMEOUT;
        while((RESET == dma_flag_get(DMA1, DMA_CH3, DMA_FLAG_FTF)) && (timeout > 0U)) {
            if(RESET != sdio_flag_get(SDIO_FLAG_DTCRCERR | SDIO_FLAG_DTTMOUT | SDIO_FLAG_RXORE | SDIO_FLAG_STBITE)) {
                break;
            }
            timeout--;
        }

        if(0U == timeout) {
            sdio_dma_disable();
            dma_channel_disable(DMA1, DMA_CH3);
            sdio_flag_clear(SDIO_MASK_INTC_FLAGS);
            return SD_DATA_TIMEOUT;
        }
        timeout = SD_DATA_POLL_TIMEOUT;
        while((!sdio_flag_get(SDIO_FLAG_DTCRCERR | SDIO_FLAG_DTTMOUT | SDIO_FLAG_RXORE | SDIO_FLAG_DTBLKEND | SDIO_FLAG_STBITE)) && (timeout > 0U)) {
            timeout--;
        }
        if(!sdio_flag_get(SDIO_FLAG_DTCRCERR | SDIO_FLAG_DTTMOUT | SDIO_FLAG_RXORE | SDIO_FLAG_DTBLKEND | SDIO_FLAG_STBITE)) {
            sdio_dma_disable();
            dma_channel_disable(DMA1, DMA_CH3);
            sdio_flag_clear(SDIO_MASK_INTC_FLAGS);
            return SD_DATA_TIMEOUT;
        }

        sdio_dma_disable();
        dma_channel_disable(DMA1, DMA_CH3);

        if(RESET != dma_flag_get(DMA1, DMA_CH3, DMA_FLAG_FEE)) {
            sdio_flag_clear(SDIO_MASK_INTC_FLAGS);
            return SD_DMA_FIFO_ERROR;
        }
        if(RESET != dma_flag_get(DMA1, DMA_CH3, DMA_FLAG_SDE)) {
            sdio_flag_clear(SDIO_MASK_INTC_FLAGS);
            return SD_DMA_SINGLE_DATA_ERROR;
        }
        if(RESET != dma_flag_get(DMA1, DMA_CH3, DMA_FLAG_TAE)) {
            sdio_flag_clear(SDIO_MASK_INTC_FLAGS);
            return SD_DMA_TRANSFER_ACCESS_ERROR;
        }

